// t35
// 数组 A 有 100 个元素，用 A[0]、A[1]、……、A[99]表示，
// 其中存放了 100 个数，从键盘输入 1 个数存放在 K 中，
// 请删除数组 A 中值为 K 的元素，
// 删除后数 K 所在位置后续的数要前移一位，输出删除后的数组。

#include <stdio.h>

int cot = 0; // K 的个数
int A[100] = { 70, 93, 49, 64, 18, 78, 54, 95, 22, 66, 77, 26, 43, 9, 70, 48, 6, 35, 65, 73, 96, 79, 10, 82, 86, 61, 16, 88, 89, 33, 47, 68, 4, 54, 84, 9, 17, 60, 22, 39, 82, 58, 6, 99, 33, 15, 34, 38, 30, 7, 17, 34, 3, 76, 98, 74, 4, 70, 15, 29, 56, 43, 88, 58, 7, 91, 25, 15, 22, 68, 56, 12, 72, 65, 58, 57, 67, 80, 63, 6, 90, 68, 35, 89, 36, 88, 60, 17, 13, 25, 38, 95, 39, 50, 50, 66, 80, 97, 55, 27 };

void rushB(int n)// 把 A[n] 后续的数前移一位
{
	int i = 0;

	for (i = n; i < 99-cot; i++)
	{
		A[i] = A[i+1];
	}
}


void printShuzu(int *a, int n)// 打印 a[0]...a[n] ,每 5 个一行
{
	int i = 0;

	for (i = 0; i < n+1; i++)
	{
		printf("a[%d]:%d  \t", i, a[i]);
		if ((i+1)%5 == 0) {
			printf("\n");
		}
	}
	printf("\n");
}


int main()
{
	int K = 0;
	int i = 0;

	printf("Input K:");
	scanf("%d", &K);

	for (i = 0; i < 100-cot; i++)
	{
		if (A[i] == K) {
			cot++;
			rushB(i);
		}
	}

	printShuzu(A, 99-cot);

	return (0);
}
