// （12）验证命题：如果一个三位整数是37的倍数，则这个整数循环左移后得到的另两个3位数也是37的倍数。
// 例如，148是37的倍数，481和814也是37的倍数。若命题正确输出所有符合命题的3位整数，否则输出“wrong”。
// 111
// 148
// 185
// 222
// 259
// 296
// 333
// 444
// 481
// 518
// 555
// 592
// 629
// 666
// 777
// 814
// 851
// 888
// 925
// 962
// 999

#include <stdio.h>

int main()
{
	int i = 100, j = 0, k = 0;

	for (i = 100; i < 1000; i++)
	{
		if (i%37 == 0) {
			j = (i%100*10 +i/100);
			k = (j%100*10 +j/100);
			if ((j%37 == 0) && (k%37 == 0)) {
				if ((j > 99) && (k > 99)) {
					printf("%d\n", i);
				}
			}else{
				printf("wrong\n");
			}
		}
	}

	return (0);
}
