// 实验6.1第(7)小题：编程用直接插入排序法对数组元素进行排序（数组元素自行初始化）
//
//    一般来说，插入排序都采用in-place在数组上实现。具体算法描述如下：
// ⒈ 从第一个元素开始，该元素可以认为已经被排序
// ⒉ 取出下一个元素，在已经排序的元素序列中从后向前扫描
// ⒊ 如果该元素（已排序）大于新元素，将该元素移到下一位置
// ⒋ 重复步骤3，直到找到已排序的元素小于或者等于新元素的位置
// ⒌ 将新元素插入到下一位置中
// ⒍ 重复步骤2---5

#include <stdio.h>

int insertion_sort(int r[])
{
	int i = 0, j = 0, x = 0;

	for (i = 2; i < 100; i++)
	{
		x = r[i];
		j = i-1;
		while (x < r[j])
		{
			r[j+1] = r[j];
			j--;
		}
		r[j+1] = x;
	}
	return (0);
}


int main()
{
	int i = 0;
	int a[100] = { 70, 93, 49, 64, 18, 78, 54, 95, 22, 66, 77, 26, 43, 9, 70, 48, 6, 35, 65, 73, 96, 79, 10, 82, 86, 61, 16, 88, 89, 33, 47, 68, 4, 54, 84, 9, 17, 60, 22, 39, 82, 58, 6, 99, 33, 15, 34, 38, 30, 7, 17, 34, 3, 76, 98, 74, 4, 70, 15, 29, 56, 43, 88, 58, 7, 91, 25, 15, 22, 68, 56, 12, 72, 65, 58, 57, 67, 80, 63, 6, 90, 68, 35, 89, 36, 88, 60, 17, 13, 25, 38, 95, 39, 50, 50, 66, 80, 97, 55, 27 };

	insertion_sort(a);

	for (i = 0; i < 100; i++)
	{
		printf("%d ", a[i]);
		if ((i+1)%5 == 0) {
			printf("\n");
		}
	}

	return (0);
}
