// t 6.2(5)
// （5）在9*9的矩阵中随机生成10个“雷”，输出“雷”的分布矩阵（扫雷游戏的初始状态）。
// 要求“雷”的位置输出字符☼（ASCII码15），非“雷”的位置输出附近有多少颗“雷”，
// 附近无雷不输出。

#include <stdio.h>
#include <stdlib.h>
#include <time.h>

int rnd(int m, int n)
{
	int num = 0;

	num = rand()%(m-n-1)+m;
	return (num);
}


int main()
{
	int i = 0, j = 0;
	int cot = 0;

	int a[9][9] = { { 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 } };

	int b[9][9] = { { 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 },
			{ 0, 0, 0, 0, 0, 0, 0, 0, 0 } };

	// get seed & bury mines
	srand(time(NULL));
	while (cot <= 10)
	{
		i = rnd(0, 10);
		j = rnd(0, 10);
		if (a[i][j] == 0) {
			a[i][j] = -1;
			cot++;
		}
	}

	// find mines
	for (i = 0; i < 9; i++)
	{
		for (j = 0; j < 9; j++)
		{
			if (a[i][j] == -1) {
				b [i][j] = -1;
			}else{
				b[i][j] += (i > 0 && j > 0 && a[i-1][j-1] == -1);       // left-up
				b[i][j] += (i > 0 && a[i-1][j] == -1);                  // up
				b[i][j] += (i > 0 && j < 8 && a[i-1][j+1] == -1);       // right-up
				b[i][j] += (j > 0 && a[i][j-1] == -1);                  // left
				b[i][j] += (j < 8 && a[i][j+1] == -1);                  // right
				b[i][j] += (i < 8 && j > 0 && a[i+1][j-1] == -1);       // down-left
				b[i][j] += (i < 8 && a[i+1][j] == -1);                  // down
				b[i][j] += (i < 8 && j < 8 && a[i+1][j+1] == -1);       // doen-right
			}
		}
	}

	// print mine & minesweeper
	for (i = 0; i < 9; i++)
	{
		for (j = 0; j < 9; j++)
		{
			printf("%2d", a[i][j]);
		}
		printf("\n");
	}
	printf("\n");

	for (i = 0; i < 9; i++)
	{
		for (j = 0; j < 9; j++)
		{
			if (b[i][j] == -1) {
				printf("%c", 15);
			}else{
				printf("%d", b[i][j]);
			}
		}
		printf("\n");
	}

	return (0);
}
