// 编写函数fun，利用指针指向二维数组，将存储的N╳N矩阵中包括主对角线
// 元素在内的左下三角元素值分别乘以n后存于原处，再计算包括主对角线元
// 素在内的右上三角元素值之和作为函数返回值。主程序给矩阵赋值并输入n,
// 调用函数并输出结果。
//     测试数据：
//         2   0   1   7   0
//         7   1   0   2   0
//         1   2   0   7   0
//         7   0   2   1   0
//         0   0   0   0   0
//     输入：n=3
//     输出：
//         6   0   1   7   0
//        21   3   0   2   0
//         3   6   0   7   0
//        21   0   6   3   0
//         0   0   0   0   0
//        sum=29
// 请认真测试程序的正确性。将源代码以文本方式提交，不要直接提交文件。

#include <stdio.h>
#define N    5
int fun(int n, int (*p)[N])
{
	int i = 0, j = 0;
	int sum = 0;

	for (i = N-1; i >= 0; i--)
	{
		for (j = 0; j <= i; j++)
		{
			p[i][j] *= n;
			sum += p[j][i];
		}
	}

	return (sum);
}


int main()
{
	int i = 0, j = 0, sum = 0;
	int a[N][N] = { { 2, 0, 1, 7, 0 },
			{ 7, 1, 0, 2, 0 },
			{ 1, 2, 0, 7, 0 },
			{ 7, 0, 2, 1, 0 },
			{ 0, 0, 0, 0, 0 }, };
	int *p = a;

	sum = fun(3, p);
	for (i = 0; i < N; i++)
	{
		for (j = 0; j < N; j++)
		{
			printf("%5d", a[i][j]);
		}
		printf("\n");
	}
	printf("sum=%d\n", sum);

	return (0);
}
