// 53.
// 集合求并集
// ⑴ 编写函数int MyUnion(int (*a)[6],int res[25])，求出a指向的数组中五
// 个集合的并集，并保存到res指向的数组中，函数返回值为并集中元素的个数
// 。所谓并集就是由出现在这些集合中任何一个集合的元素组成的集合。
// ⑵ 编写main函数，初始化二维数组sec：每行保存一个整数集合，共5个集合
// ，每个集合最多5个元素，sec数组每行的第一个元素中保存一个集合中元素的
// 个数，后面跟着该集合中的具体元素的值，调用MyUnion函数求出并集并输出。
// 【测试数据】
// 五个集合分别为：
// {12,35,3,9},{2,35,9},{35,12,0,1,9},{90},{9,0}
// 数组sec[5][6]={{4,12,35,3,9},{3,2,35,9},{5,35,12,0,1,9},{1,90},
// {2,9,0}};
// 【运行结果】
// 12	35	3	9	2	0	1	90
// 请认真测试程序的正确性。将源代码以文本方式提交，不要直接提交文件。

#include <stdio.h>
int ifIn(int n, int *p)
{
	int i = 0;

	for (i = 0; i < 25; i++)
	{
		if (p[i] == n) {
			return (1);
		}
	}

	return (-1);
}


int MyUnion(int (*a)[6], int *res)
{
	int i = 0, j = 0;
	int aj = 0;

	for (i = 0; i < 5; i++)
	{
		for (j = 1; j <= a[i][0]; j++)
		{
			if (ifIn(a[i][j], res) == -1) {
				res[aj] = a[i][j];
				aj++;
			}
		}
	}
	return (aj);
}


int main()
{
	int i = 0, aj = 0;
	int sec[5][6] = { { 4, 12, 35, 3, 9 },
			  { 3,	2, 35,9 },
			  { 5, 35, 12, 0,1, 9 },
			  { 1,90 },
			  { 2,	9, 0 } };
	int res[25] = { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, };

	aj = MyUnion(sec, res);
	for (i = 0; i < aj; i++)
	{
		printf("%5d", res[i]);
	}
	printf("\n");
}
